-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2022-07-06 08:53:02
-- 伺服器版本： 10.4.24-MariaDB
-- PHP 版本： 7.4.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `mfee27_group2_project`
--

-- --------------------------------------------------------

--
-- 資料表結構 `products`
--

CREATE TABLE `products` (
  `id` int(5) UNSIGNED NOT NULL,
  `name` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL,
  `price` int(7) UNSIGNED NOT NULL,
  `company_id` int(5) NOT NULL,
  `inventory` int(3) UNSIGNED NOT NULL,
  `category_main` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL,
  `category_sub` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL,
  `spec` varchar(500) COLLATE utf8mb4_unicode_ci NOT NULL,
  `intro` varchar(300) COLLATE utf8mb4_unicode_ci NOT NULL,
  `create_time` datetime NOT NULL,
  `product_main_img` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `valid` int(2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `products`
--

INSERT INTO `products` (`id`, `name`, `price`, `company_id`, `inventory`, `category_main`, `category_sub`, `spec`, `intro`, `create_time`, `product_main_img`, `valid`) VALUES
(1, 'Ultra氣炸鍋台銘', 2390, 1, 65, '1', '1', '品牌        Tefal特福\r\n型號        EY111B70\r\n產地        中國\r\n商品尺寸(材積)        39.8X31.4X37\r\n電壓        110V\r\n頻率        60Hz\r\n消耗功率        1000W以上\r\n產品重量        5\r\n容量        2公升以上\r\n保固        1年\r\nBSMI許可字號        R31663', '簡易上手 按鍵式介面\r\n可調整溫度為70到200°C\r\n優化熱流循環 保有食材原味原汁\r\n超大容量4.2公升\r\n八種自動行程', '2022-07-04 20:54:04', 'tefal_EY111B70.jpg', 1),
(2, '美式滴漏式咖啡機HD7432', 1190, 2, 20, '2', '2', '\"◎ 型號 : HD7432/21\r\n◎ 保固 : 2年\r\n\r\n◎ BSMI : CI3D0069040402\r\n◎ 香氣環繞設計\r\n◎ 600毫升，可沖煮2_7杯\r\n◎ 防滴漏設計\r\n◎ 30分鐘自動斷電\r\n◎ 智慧型水位指示\r\n◎ 高低溫耐受玻璃壺\r\n◎ 底盤通電發熱保溫(通電狀態下)\r\n◎ 零件可拆方便清洗\r\n◎ 商品網頁說明僅供參考，實際商品規格以原廠出貨為準\"', '\"★ 香氣環繞設計\r\n★ 600毫升，可沖煮2_7杯\r\n★ 防滴漏設計\r\n★ 30分鐘自動斷電\r\n★ 智慧型水位指示\r\n★ 高低溫耐受玻璃壺\r\n★ 底盤通電發熱保溫(通電狀態下)\r\n★ 零件可拆方便清洗\r\n★ 商品網頁說明僅供參考，實際商品規格以原廠出貨為準\"', '2022-07-04 20:54:04', 'PHILIPS_HD7432.jpg', 1),
(3, 'KFJ_A02N1咖啡機', 3850, 3, 30, '2', '2', '\"規格：\r\n產品尺寸：長259mm；寬148mm；高309mm\r\n額定功率：800W\r\n額定電壓：220V\r\n產品淨重：1.82kg\r\n電源線長：0.8m\r\n容量：0.6L_1.2L\r\n研磨檔位：2.5檔\r\n特色功能：奶泡口感可調；蒸汽可調；保溫\r\n泵浦壓力：5Bar\r\n認證型號：KFJ_A02N1\r\n顏色：不銹鋼銀\"', '\"★萃取與奶泡合一，滿足您對花式咖啡的幻想。\r\n★輕鬆萃取，一嘗香濃。\r\n★水溫控制，自動調節。\"', '2022-07-04 20:54:04', 'Bear_KFJ_A02N1.jpg', 1),
(4, '全自動美式咖啡機', 5580, 2, 30, '2', '2', '\"規格：\r\n◆型號：HD7762\r\n◆產地： 中國 \r\n◆包裝尺寸： 277 x 212 x 440 mm\r\n◆重量：4.6kg\"', '\"★密閉式左右雙豆槽設計\r\n★14段式錐形研磨設定\r\n★多功能整合式飛梭旋鈕\"', '2022-07-04 20:54:04', 'PHILIPS_HD7762.jpg', 1),
(5, '1.5L雙層防燙電水壺', 1690, 4, 50, '2', '4', '\"規格：\r\n型號:NC_KD300\r\n顏色:白色\r\n容量:1.5L\r\n商品尺寸:223*230*159mm(寬高深)\r\n商品重量:1.4kg(壺身+電源底座)\r\n電源規格:110V/60Hz\r\n消耗功率:1200W\r\nBSMI:R31017\"', '\"★雙層防燙好安心\r\n★多重保護裝置\r\n★清洗真方便\"', '2022-07-04 20:54:04', 'Panasonic_NC_KD300.jpg', 1),
(6, '0.8L溫控手沖壺', 2180, 5, 20, '2', '4', '\"容量：1公升以下\r\n電壓：110V\r\n頻率：60Hz\r\n消耗功率：900W~1000W\r\n尺寸：281x188x237mm(寬*高*深)\r\n重量：1.0Kg\r\n內膽材質：304不鏽鋼\"', '\"專業手沖，手停水即停：極細口5mm壼嘴設計，精準控制方向與流量。_\r\n智慧觸控+LED顯示面板，煮沸、保溫輕鬆一指搞定。\r\nLED顯示面板\r\n約4分鐘超快速，約4分鐘超快速煮沸，完成後音樂聲貼心提醒。\r\n6段溫定設定，隨心所欲調整溫度：預設6段溫定設定（60/70/80/85/90/95度)\r\n可恆溫設定，隨時保持最佳溫度：可恆溫設定，低於幾度就自動加熱。\r\n可以1度1度增減溫度\r\n360度分離式底座，方便好拿取\r\n三重安全保護：沸騰自動斷電、防空燒保護、溫度保險絲_\"', '2022-07-04 20:54:04', 'SAMPO_KP_UA08MT.jpg', 1),
(7, '全開口式不鏽鋼炫彩快煮壺', 790, 6, 20, '2', '4', '\"規格:\r\n品牌:KRIA可利亞\r\n型號:KR_302\r\n容量:1~2公升\r\n電壓:110V\r\n頻率:60Hz\r\n消耗功率:900W~1000W\r\n尺寸:16.2× 23 × 24 (cm)\r\n重量:0.85 kg\r\n內膽材質:不鏽鋼\"', '\"壼座分離無線式設計\r\n水壺可360°任何角度放置\r\n沸騰後電源自動關閉安全裝置\r\n出水口貼心濾網設計\r\n無水乾燒自動斷電功能\"', '2022-07-04 20:54:04', 'KRIA_KR_302.jpg', 1),
(8, 'SOURCE氣泡水機(白)', 4703, 7, 55, '2', '3', '\"品牌	Sodastream\r\n型號	1019511864\r\n產地	以色列\r\n氣瓶材質	鋁\r\n機身材質	ABS塑鋼\r\n商品尺寸(材積)	高 42.5cm 正面寬 12cm 側面寬 21.5cm\r\n產品重量	4.7\r\n容量(公升)	1L以下\r\n保固	2年\r\n配件	氣瓶, 二氧化碳補充鋼瓶, 使用手冊, 保證書\"', '\"■ 不用插電、不需電力\r\n■ 添加糖漿或果汁成為各式汽水/調酒\r\n■ 全新自動扣瓶裝置\r\n■ 三階段氣泡含量指示\"', '2022-07-04 20:54:04', 'SodaStream_SOURCE_W.jpg', 1),
(9, '全自動氣泡水機_經典白 BS_909', 2990, 8, 44, '2', '3', '\"◆商品尺寸：高410 x 寬130 x 深220 (mm)\r\n◆淨重：1.58(±0.2) kg\r\n◆主機產地：中國\r\n◆鋼瓶產地：台灣\r\n◆內容物：氣泡水機*1、專用瓶1L*1、食用級二氧化碳氣瓶*1、產品使用手冊與保證書\r\n◆國際條碼：4710686989099\r\n◆保固：正常使用下主機保固兩年\"', '\"專利渦流進氣設計氣泡口感最佳化\r\n環保節能、免插電電池\r\n只需按壓一次，氣就會直接充飽\r\n食用級二氧化碳，多國安全認證\"', '2022-07-04 20:54:04', 'BubbleSoda_BS909.jpg', 1),
(10, '輕盈氣泡水機(搭配CO2氣瓶1支) BW', 2180, 9, 33, '2', '3', '\"品牌        阿基姆 AGiM\r\n型號        BWM_S66_WH+BWM_01\r\n產地        中國\r\n氣瓶材質        鋁\r\n機身材質        塑膠\r\n商品尺寸(材積)        氣泡水機250x143x476mm，單支氣瓶58x58x365mm\r\n產品重量        氣泡水機1.36kg，單支氣瓶1.23kg\r\n容量(公升)        1L以下\r\n保固        1年\r\n配件        氣瓶, 保證書, 使用手冊\"', '\"比市售機型提升20%氣泡量\r\n符合人體工學不費力壓桿注氣設計\r\n注氣壓力過大會自動安全洩壓排氣\r\n氣瓶安裝簡單，相容廣泛\r\n1000ml超大水瓶不含雙酚A\"', '2022-07-04 20:54:04', 'AGiM_BWM_S66_WH.jpg', 1),
(11, '便攜磨豆機‧完整慢磨神器G1', 2280, 10, 22, '2', '5', '\"品牌        其他品牌\r\n產地        中國\r\n類型        電動\r\n內部材質        ABS塑鋼\r\n顏色        黑色系\r\n重量        485g\r\n尺寸        W85 x D85 x H175 mm\r\n豆槽容量        200~500g\r\n配件        機體、玻璃粉倉、毛刷、Micro USB 充電線、止滑墊\r\n保固        1年\"', '\"品特色\r\n重量僅有485G，不占空間\r\n800mAh鋰電池USB 充電\r\n外調式五段刻度\r\n豆倉磨豆結束，感應自動停止功能\r\n錐刀研磨，使用陶瓷磨芯\"', '2022-07-04 20:54:04', 'Oceanrich_G1.jpg', 1),
(12, '電動咖啡磨豆機HCG_60K1', 748, 11, 11, '2', '5', '\"品牌        其他品牌\r\n產地        中國\r\n類型        電動\r\n內部材質        不鏽鋼\r\n顏色        銀色系\r\n電壓        110V\r\n頻率        60Hz\r\n消耗功率        200W以下\r\n重量        0.76kg\r\n尺寸        183 x 89 x 89 mm\r\n豆槽容量        200g以下\r\n配件        _\r\n保固        1年\"', '\"26000RPM超強馬力\r\n透明上蓋\r\n分離式磨豆杯\r\n按壓式開關\r\n高強度不鏽鋼磨刀\"', '2022-07-04 20:54:04', 'HERAN_HCG_60k1.jpeg', 1),
(13, '義大利復古美學 定量磨豆機_魅惑紅', 12510, 12, 1, '2', '5', '\"品牌        其他品牌\r\n產地        中國\r\n類型        電動\r\n內部材質        不鏽鋼\r\n顏色        紅色系\r\n頻率        60Hz\r\n消耗功率        200W以下\r\n重量        3.1KG\r\n尺寸        250 x 460 x 170 mm\r\n豆槽容量        200~500g\r\n配件        接粉罐\r\n保固        1年\"', '\"6段定量模式，依需求設定粉量\r\n30 段精準研磨粗細調節\r\n錐形不鏽鋼刀均勻研磨保留咖啡香\r\n防靜電設計，落粉集中不易殘粉\r\n可拆式上刀盤，清潔更加便利\"', '2022-07-04 20:54:04', 'SMEG_CGF01_W.jpg', 1),
(14, '小偏心纖活果汁機 MX_1500T2 ', 1288, 13, 29, '2', '6', '\"品牌	其他品牌\r\n類型	傳統果汁機\r\n型號	MX_1500T2\r\n產地	中國\r\n內部材質	高硼砂玻璃\r\n電壓	110V\r\n商品尺寸(材積)	L220 X W185 X H401 mm\r\n產品重量	3.5KG\r\n容量(公升)	1~2L\r\n回轉數(RPM)	15000~20000轉\r\n保固	1年\r\n消耗功率	300~400W\"', '\"奇美專利，刀座與杯身偏移5mm\r\n3段式轉速_瞬轉/低速/高速\r\n底部吸盤止滑墊、安全穩定\r\n杯蓋與基座可分離式收納\r\n基座凹槽排水設計,方便清潔\"', '2022-07-04 20:54:04', 'CHIMEI_MX_1500T2.jpg', 1),
(15, '冷熱多功能調理機SSB_1TW', 2490, 14, 31, '2', '6', '\"品牌	Cuisinart\r\n類型	專業型調理機\r\n型號	SSB_1TWN\r\n產地	中國\r\n內部材質	高硼砂玻璃\r\n電壓	110V\r\n商品尺寸(材積)	22.5×21×46.5cm\r\n產品重量	4.64kg\r\n容量(公升)	1~2L\r\n回轉數(RPM)	20000~25000轉\r\n保固	1年\r\n消耗功率	800~900W\r\n特殊功能	加熱\r\nBSMI許可字號	R3A130\r\n注意事項	2012年出廠(可以接受再購買)\"', '\"1750CC大容量，四段變速\r\n六葉片不鏽鋼刀頭，可碎冰\r\n可快速爆香食材及煮滾熱湯\r\n高溫、低溫、燉煮\r\n安全裝置：離杯、過熱自動斷電\"', '2022-07-04 20:54:04', 'Cuisinart_SSB_1TWN.jpg', 1),
(16, '隔音罩果汁機53604_TW', 2691, 15, 52, '2', '6', '\"品牌	Hamilton Beach\r\n類型	專業型調理機\r\n型號	53604_TW\r\n產地	其他國家\r\n內部材質	不鏽鋼\r\n電壓	110V\r\n商品尺寸(材積)	43 x 22 x 18.5 cm\r\n產品重量	4.2 公斤\r\n容量(公升)	1~2L\r\n回轉數(RPM)	15000~20000轉\r\n保固	1年\r\n消耗功率	300~400W\r\n內容物	主機 x1 、玻璃容杯（含蓋）x1、可拆卸隔音罩 x1、中文說明手冊 x 1\r\n裝箱尺寸	27 x 40 x 40cm cm\r\n裝箱重量	5.2 公斤\r\n5.2 公斤	美國設計中國組裝\r\n保固.	總代理公司貨 1 年主機保固（不含配件）\r\nBSMI	R39624\r\n★	本產品已投保富邦產品責任險六千萬元。\r\n※ 注意 ①	本商品無提供試用，產品一經使用無法整新賣給下一位消費者因此產品一經使用將影響退換商品權益且酌收清潔費用，訂貨前請先確認評估。\r\n※ 注意 ②	本產品僅限一般家庭需求使用。\r\n※ 注意 ③	部分配件屬消耗品，正常使用下所造成的磨損屬正常現象（非保固範圍內）。\"', '\"美國百年廚房小家電第一品牌\r\n3段變速加冰沙模式與瞬轉功能\r\n每分18000轉強力馬達\r\n1.5L大容量一次約可打5人份\r\n高品質玻璃容杯降低細菌滋生\"', '2022-07-04 20:54:04', 'Hamilton Beach_53604_TW.jpg', 1),
(17, 'MINI美食調理鍋 EP_02MC20', 999, 13, 64, '1', '7', '\"品牌	其他品牌\r\n型號	EP_02MC20\r\n容量	1~2公升\r\n電壓	110V\r\n頻率	60Hz\r\n消耗功率	500~600W\r\n尺寸	L318 x W196 x H212 mm\r\n重量	1.5 KG\r\n材質	304不鏽鋼\r\n產地	中國\r\n保固	1年\r\nBSMI許可字號	R63999\"', '\"蒸、煮、滷、燉皆適用\r\n人體工學設計、單手操控火力\r\n304不銹鋼、內鍋無接縫設計\r\n雙層防燙機身、電源收納設計\r\n防乾燒斷電保護、使用更安全\"', '2022-07-04 20:54:04', 'CHIMEI_EP_02MC20.jpg', 1),
(18, '1L四段溫控多功能不沾調理鍋(美食鍋/快', 3490, 16, 80, '1', '7', '\"品牌	其他品牌\r\n型號	SK_M1520_C\r\n容量	1公升以下\r\n電壓	110V\r\n頻率	60Hz\r\n消耗功率	1000W以上\r\n尺寸	寬28.2 x 深18.2 x 高18.3 cm\r\n重量	1.8 kg\r\n材質	不鏽鋼\r\n產地	中國\r\n配件	主機, 底座\r\n保固	1年\r\nBSMI許可字號	R41A01\"', '\"精準4段溫控，一鍋多用\r\n不沾材質，好清洗不黏底\r\n19cm大口徑，食材下鍋好方便\r\n易傾倒鍋緣，防止湯汁外溢\r\n五重安全設計，使用更安心\"', '2022-07-04 20:54:04', 'Siroca_SK_M1520_C.jpg', 1),
(19, '多功能調理鍋 DB_701HP', 1683, 17, 81, '1', '7', '\"品牌	其他品牌\r\n類型	電火鍋\r\n型號	DB_701HP\r\n顏色	藍色系\r\n產地	中國\r\n商品尺寸(材積)	寬245x深213x高187mm\r\n電壓	110V\r\n頻率	60Hz\r\n產品重量	2.3 kg\r\n容量	2人份\r\n內鍋材質	不粘塗層合金\r\n配件	湯鍋、煎鍋、玻璃蓋、蒸架、防濺蓋\r\n消耗功率	600~700W\r\n保固	1年\r\nBSMI許可字號	R3D006\"', '\"煎/蒸/煮 滿足各式料理需求\r\n三段溫度調節旋鈕 簡單好上手\r\n透明玻璃蓋 料理過程一目了然\r\n上蓋、蒸架、防濺蓋_配件齊全\r\n三段溫度選擇 具加熱指示燈\"', '2022-07-04 20:54:04', 'DANBY_DB_701HP.jpg', 1),
(20, '氣炸鍋 智慧 氣炸鍋 3.5L 原廠保固', 1739, 18, 55, '1', '1', '\"品牌        其他品牌\r\n型號        小米智慧氣炸鍋 3.5L\r\n產地        中國\r\n氣炸網材質        304不鏽鋼\r\n氣炸盤材質        鋁合金\r\n商品尺寸(材積)        30cm*37cm*35cm\r\n電壓        100V\r\n頻率        60Hz\r\n消耗功率        1000W以上\r\n產品重量        3.9公斤\r\n容量        2公升以上\r\n保固        1年\r\n配件        使用說明保證書, 中文說明書, 烤盤\r\n特殊功能        數位觸控式顯示幕\r\nBSMI許可字號        CI390062452718\"', '\"長達24小時智慧定時\r\n拉出炸籃暫停\r\nOLED觸控螢幕\r\n雙層不黏塗層\r\n小體積、易收納\"', '2022-07-04 20:54:04', 'xiaomi_3.5L.jpg', 1),
(21, 'Easy Fry燒烤二合一氣炸鍋+NEO', 3671, 1, 19, '1', '1', '\"品牌        Tefal特福\r\n型號        EY501870\r\n產地        中國\r\n商品尺寸(材積)        39.8X31.4X37\r\n電壓        110V\r\n頻率        60Hz\r\n消耗功率        1000W以上\r\n產品重量        4\r\n容量        2公升以上\r\n保固        1年\r\nBSMI許可字號        CI310066630652\"', '\"雙旋鈕控制 簡單清晰好操作\r\n不沾塗層優點 清潔超簡單\r\n快速氣流循環 保有食材原味原汁\r\n超大容量4.2公升\r\n獨家完美烤盤 做出炙燒烤痕\"', '2022-07-04 20:54:04', 'tefal_EY501870.jpg', 1),
(22, 'SEKA 多功能電烤盤(贈平煎烤盤+料理', 2890, 19, 51, '1', '9', '\"品牌	其他品牌\r\n型號	SN_SEG\r\n產地	中國\r\n商品尺寸(材積)	_\r\n電壓	110V\r\n頻率	60Hz\r\n消耗功率	1000W以上\r\n產品重量	約4008g±10% (主機+平盤+深鍋+分隔盤)\r\n容量	1_2公升\r\n保固	1年\r\n配件	烤盤, 使用說明保證書\r\nBSMI許可字號	R54116\r\n組合說明	【多功能電烤盤主機】\r\n件數：1入\r\n材質：冷軋板(SPCC)\r\n尺寸：長38.5x寬24x高19.5 cm (含上蓋與平煎烤盤的高度)\r\n重量：約2570g±10% (含蓋)\r\n額定電壓：110V/60Hz\r\n額定功率：1200W\r\n溫度範圍：80_230°C\r\n\r\n【配件平煎烤盤】\r\n件數：1入\r\n材質：壓鐵鋁(不沾塗層)\r\n\r\n【配件料理深鍋】\r\n件數：1入\r\n材質：壓鐵鋁(不沾塗層)\r\n尺寸：長34.5x寬25.7x高8 cm\r\n重量：約846g±5%\r\n\r\n【配件分隔料理盤】\r\n件數：1入\r\n材質：壓鐵鋁(不沾塗層)\r\n尺寸：長33x寬24.5x高3.7 cm\r\n重量：約592g±5%\r\n顏色	白色, 綠色\"', '\"煎烤炒煮蒸，美味料理一機搞定\r\n1200W大功率速熱\r\n不沾塗層烤盤，清洗更容易\r\n防燙手柄，安全隔熱，拿取不燙手\r\n分離式電源設計，方便好收納\"', '2022-07-04 20:54:04', 'snapware_SN_SEG.jpg', 1),
(23, '9公升蒸氣烘焙烤箱 (TOT_S922W', 1590, 20, 25, '1', '8', '\"品牌	TATUNG大同\r\n型號	TOT_S922W\r\n產地	中國\r\n內部材質	鍍鋅鋁板\r\n特殊功能	烘焙功能, 蒸氣功能\r\n商品尺寸(材積)	寬313x高228x深247 (mm)\r\n電壓	110V\r\n頻率	60Hz\r\n產品重量	2.6kg\r\n容量	20L以下\r\n保固	1年\r\n消耗功率	700~800W\r\nBSMI許可字號	R31001\r\n內部材質(正確)	鍍鋅鋁板\r\n(上方的內部材質有誤,並不是鍍鋅鋼板)\"', '\"9L高箱體設計，方便擺放\r\n上下火分段控制\r\n15分鐘定時\r\n復古文青淺焙奶茶色\r\n頂蓋加水即可蒸氣烘烤\"', '2022-07-04 20:54:04', 'tatung_TOT_S922W.jpg', 1),
(24, '32公升雙溫控旋風電烤箱 TL1_MC3', 4980, 21, 5, '1', '8', '\"品牌        TOSHIBA東芝\r\n型號        TL1_MC32AZT_GR\r\n產地        中國\r\n內部材質        鍍鋅鋼板\r\n特殊功能        烘焙功能, 發酵功能, 上下溫控獨立\r\n商品尺寸(材積)        寬495 x 高325 x 深405 (mm)\r\n電壓        110V\r\n頻率        60Hz\r\n產品重量        9.1Kg\r\n容量        30_40L\r\n保固        1年\r\n配件        琺瑯烤盤、烤網、旋轉烤叉、集屑盤、取物夾、取物支架、說明書\r\n電源線長        1公尺\r\n消耗功率        1400~1500W\r\nBSMI許可字號        T3D387\"', '\"上下火獨立控溫，靈活烘烤\r\n70_230°C廣域溫控\r\n含鈦不鏽鋼加熱管，耐腐蝕壽命長\r\n旋風熱能包覆，完美上色\"', '2022-07-04 20:54:04', 'toshiba_TL1_MC32AZT_GR.jpg', 1),
(25, '多功能電烤盤-經典款(珊瑚紅)', 3290, 22, 66, '1', '9', '\"品牌:其他品牌\r\n型號:BOE021\r\n產地:中國\r\n內部材質:鋼材\r\n商品尺寸(材積):W37.5 x D23.5 x H14cm\r\n電壓:110V\r\n頻率: 60Hz\r\n產品重量:2.3kg\r\n容量:20L以下\r\n保固:1年\r\n配件:電源線、章魚燒烤盤、平盤、木匙\r\n電源線長:約180cm\r\n消耗功率:1100~1200W\r\nBSMI:BSMI識別碼：R31310\r\n證書號碼：CI319063102882 號00\"', '\"耐高溫不沾塗層烤盤\r\n導熱快、清洗方便\r\n兩用木匙，取出烤盤不燙手\r\n分離式電源，方便使用好收納\r\n牛排或章魚燒皆適合\"', '2022-07-04 20:54:04', 'Bruno_BOE021.jpeg', 1),
(26, 'BOE059 多功能電烤盤 (嚕嚕米清新', 4280, 22, 88, '1', '9', '\"品牌:其他品牌\r\n型號:BOE059-BGR\r\n產地:中國\r\n內部材質:鋼材\r\n商品尺寸(材積):W37.5 x D23.5 x H14cm\r\n電壓:110V\r\n頻率: 60Hz\r\n產品重量:2.3kg\r\n容量:20L以下\r\n保固:1年\r\n配件:電源線、章魚燒烤盤、平盤、木匙\r\n電源線長:約180cm\r\n消耗功率:1100~1200W\r\nBSMI:BSMI識別碼：R64875\r\n證書號碼：CI319063102882 號00\"', '\"不沾黏烤盤材質\r\n5段火力，最高溫度250度\r\n尺寸精巧 約 A4 大小\"', '2022-07-04 20:54:04', 'Bruno_BOE059_BGR.jpeg', 1),
(27, '多功能電烤盤 SEBW-Q699-(標配', 3723, 23, 32, '1', '9', '\"品牌:SANSUI山水\r\n類型:電火鍋\r\n型號:SEBW-Q699\r\n產地:中國\r\n商品尺寸(材積:480*200*356mm\r\n電壓:110V\r\n頻率:60Hz\r\n產品重量:3.3KG\r\n容量:5人份\r\n內鍋材質:陶瓷\r\n配件:主機、烤盤、章魚燒烤盤、鍋鏟、章魚燒叉\r\n消耗功率:1100~1200W\r\n保固:1年\r\nBSMI許可字號:R51434\"', '\"多功能配件，百變創意料理\r\n1200W大火力，全面快速受熱\r\n四段火力調節，因應料理需求\r\n分離式電源，方便使用好收納\r\n商品享一年原廠保固\"', '2022-07-04 21:51:35', 'SANSUI_SEBW_Q699.jpeg', 1),
(28, '無線玻璃隨行果汁機LT-MCJ2069(', 799, 24, 43, '2', '10', '\"品牌:其他品牌\r\n類型:傳統果汁機\r\n型號:LT-MCJ2069\r\n產地:中國\r\n內部材質:高硼砂玻璃\r\n電壓:110V\r\n商品尺寸(材積):(W)90*(D)82*(H)185mm\r\n產品重量:580g\r\n容量(公升):1L以下\r\n回轉數(RPM):10000轉以下\r\n保固:1年\r\n消耗功率:200W以下\r\nBSMI許可字號:免驗\r\n顏色:橄欖綠\"', '\"玻璃杯身，無塑化劑\r\n附贈飲式杯蓋，替換可作隨行杯\r\n304不銹鋼六刀片\r\n雙節電池，馬力更強\r\nUSB充電設計，方便隨時充電\"', '2022-07-04 21:57:21', 'TELEFUNKEN_LT_MCJ2069.jpeg', 1),
(29, '拉霸隨行果汁機-雙杯組(CRN-LJ19', 1178, 25, 28, '2', '10', '\"品牌:其他品牌\r\n類型:傳統果汁機\r\n型號:CRN-LJ1908\r\n產地:中國\r\n內部材質:TRITAN共聚酯\r\n電壓:110V\r\n商品尺寸(材積):60 (W) x 150 (D) x 136 (H) mm\r\n產品重量:1.7KG\r\n容量(公升):1L以下\r\n回轉數(RPM):20000~25000轉\r\n保固:1年\r\n消耗功率:200~300W\"', '\"一機雙杯，玻璃梅森杯+隨行杯\r\n6刀頭食品級304不銹鋼\r\n可拆卸刀座清洗方便\"', '2022-07-04 21:59:42', 'CORONA_CRN_LJ1908.jpeg', 1),
(30, 'NU90 保溫保冰隨行果汁機(粉藍色)', 909, 26, 17, '2', '10', '\"品牌:其他品牌\r\n類型:榨汁機\r\n型號:NU90\r\n產地:中國\r\n內部材質:304不鏽鋼\r\n電壓:110V\r\n容量(公升):1L以下\r\n回轉數(RPM):15000~20000轉\r\n保固:1年\r\n消耗功率:200W以下\r\n顏色:粉藍\"', '\"長達6小時，保溫&保冷，給您想要的溫度。\r\n榨汁、攪拌、冷飲、熱飲，多種花樣料理。\r\n業界首創採用SUS304不銹鋼杯身，安全無害。\r\n主機攪拌杯蓋+直飲杯蓋，雙杯蓋配置，滿足多種應用場景。\r\n360度防漏水杯蓋，與不銹鋼杯身，形成完美契合，並具有洩氣伐，輕鬆開蓋飲用。\r\n無線使用設計，家用、上班、健身、旅遊，隨處可用。 \"', '2022-07-04 21:59:42', 'Deerma_NU90.webp', 1),
(31, '熱壓吐司鬆餅機 MF-1115P', 1080, 31, 46, '1', '11', '\"品名：鍋寶 熱壓吐司鬆餅機\r\n型號：MF-1115P\r\n額定電壓：110V\r\n額定頻率：60HZ\r\n總額定消耗功率：600W\r\n材質：上蓋、底座／電木\r\n　　　安全卡扣／PPS\r\n　　　格紋烤盤、斜紋烤盤／高級合金+食品級不沾層(耐熱260℃)\r\n重量：約1kg±5%\r\n尺寸：約長21x寬13x高9cm±5%\r\n附件：主機體x1、格紋烤盤x2、斜紋烤盤x2、說明書x1\r\n數量：乙入\r\n產地：中國\"', '\"斜紋+格紋雙烤盤，美味自由變換\r\n食品級不沾烤盤，不沾黏好料理\r\n活動式卡榫，輕推即可輕鬆換烤盤\r\n防滑底部+集線設計，直立好收納\r\n自動控溫+安全自動斷電，更安心\"', '2022-07-04 21:59:42', 'CookPower_MF_1115PK.jpeg', 1),
(32, '熱壓三明治鬆餅機 (薰衣草紫)', 1980, 22, 20, '1', '11', '\"額定電源：AC110 60Hz\r\n耗電量：550w\r\n產品尺寸：W135xH96xD246mm\r\n包裝尺寸：W160xH140xD312mm\r\n產品重量：1.3kg(連烤盤使用)\r\n材質：主體:不銹鋼/酚醛樹脂\r\n烤盤:鋁合金(氟樹脂塗層)\r\n安全裝置：溫度調節器 保險絲216℃\r\n線長：110cm\r\n\r\nBSMI識別碼：R31310\r\n證書號碼：CI318063102618 號00\"', '\"定時旋鈕0~10分鐘\r\n上下加熱管,讓食材均勻受熱\r\n輕量小巧 可直立收納\"', '2022-07-04 21:59:42', 'BRUNO_BOE043_PP.webp', 1),
(33, 'SlimPlus調理棒全配組 (貴族紅)', 2880, 27, 34, '1', '11', '\"品名：recolte 日本麗克特 Slim Plus 調理棒 (全配組)\r\n型號：RHB-1\r\n電壓：110V/60Hz \r\n功率： 200 W(攪拌棒) / 50W(打蛋器)\r\n尺寸：58寬x 58深x 360高(mm) (主機+攪拌棒)\r\n73寬x 64深x 380高(mm) (主機+打蛋器)\r\n176寬x 130深x 233高(mm) (調理杯+蓋)\r\n重量：約550克 (主機+攪拌棒)\r\n約600克 (主機+打蛋器)\r\n約350克 (調理杯+蓋)\r\n彩盒尺寸：158寬x158深x 188高(mm)\r\n包裝總重量：約1250g\r\n電源線長：約1.6公尺\r\n材質：攪拌棒、打蛋器-304不鏽鋼\r\n調理杯-TRITAN\r\n清潔刷：尼龍\r\n設計：日本設計 \r\n產地：中國製造\"', '\"日本設計，提出全新收納概念\r\n針對女性的小手設計輕量纖細好握持\r\n貼心安全設計，具電源開關鎖\r\n6段速度調節旋鈕，可調理豐富食材\"', '2022-07-04 21:59:42', 'recolte_RHB_R.webp', 1),
(34, '厚燒格子三明治機 微笑限定款(RPS-2', 1580, 27, 14, '1', '11', '\"品名：recolte 日本麗克特 Plaid 厚燒格子三明治機\r\n型號：RPS-2\r\n電壓：110V/60Hz\r\n功率：700W\r\n本體尺寸(寬x深x高)：約W130xD210xH120mm\r\n本體重量：約960g\r\n包裝尺寸(寬X深X高)：約W170xD155xH240mm\r\n烤盤尺寸(寬x長)：W127xD145mm\r\n烤盤深度 : 25mm(可用卡榫加厚至50mm)\r\n設計：日本設計\r\n產地：中國製造\r\n保固：台灣公司貨 1年保固\"', '\"輕鬆壓出可愛笑臉\r\n厚度增加約2.5倍\r\n隨附50道豪華食譜書\"', '2022-07-04 21:59:42', 'recolte_RPS_Y.webp', 1),
(35, '多功能變速調理棒四件組 (JC-35)', 1280, 28, 27, '1', '12', '\"額定電壓/頻率：AC110V/60Hz\r\n總額定消耗電功率：95W\r\n材質：ABS塑料、AS樹脂、不鏽鋼\r\n容量：調理杯600ml、切碎盆500ml\r\n產品轉速：11000-15500%±15% (回轉速PRM)\r\n可耐熱溫度：刀組60OC、杯子/蓋：100OC\r\n產品重量：主機640g、攪拌棒(附刀)104g、調理杯115g、切碎盆(附蓋及刀座)285g、打蛋器80g\r\n配件：攪拌棒(附刀)、調理杯、切碎盆(附蓋及刀座)、打蛋器\r\n產品尺寸： W52xH211xD52 mm\r\n產品重量： 640 g\r\n包裝尺寸： W237xH250xD137 mm\"', '\"8檔漸進式變速調整+TURBO加速瞬轉\r\n分離式不鏽鋼攪拌棒，方便拆裝清洗安全衛生\r\n一機多用，附多種配件，輕鬆一按快速更換\"', '2022-07-04 21:59:42', 'KINYO_JC_35.webp', 1),
(36, '5.5L新式高效專業抬頭式攪拌機SK-9', 10115, 29, 15, '1', '12', '\"額定電壓：110V / 60Hz │ 消耗功率：650W\r\n國際條碼：4710299-701378\r\n彩盒尺寸：W416xD260xH340(mm)\r\n機體尺寸：W360xD240xH320(mm)\r\n產地：中國\"', '\"高性能全銅線電機\r\n六種檔位選擇\r\n迅速成團、快速出膜\"', '2022-07-04 21:59:42', 'YAMASAKI_SK_9990SP.webp', 1),
(37, '8公升日式小烤箱 TM-MG08CZT(', 2480, 21, 23, '1', '8', '\"品牌	TOSHIBA東芝\r\n型號	TM-MG08CZT-AT\r\n產地	中國\r\n內部材質	不鏽鋼\r\n特殊功能	烘焙功能, 專用立體反射板\r\n商品尺寸(材積)	寬300 x 高227 x 深272 (mm)\r\n電壓	110V\r\n頻率	60Hz\r\n產品重量	3.1Kg\r\n容量	20L以下\r\n保固	1年\r\n配件	烤盤、烤網、集屑盤、說明書\r\n電源線長	1公尺\r\n消耗功率	900~1000W\r\nBSMI許可字號	T3D387\r\n商檢字號	T3D387\"', '\"上下加熱管+360°熱反射腔體\r\n4段加熱檔位，靈活調整\r\n旋鈕操作直覺簡易\r\n小巧卻強大，主食甜點一機搞定\"', '2022-07-04 21:59:42', 'toshiba_TM_MG08CZT_AT.jpg', 1);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `products`
--
ALTER TABLE `products`
  MODIFY `id` int(5) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3030;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
