-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2022-07-03 22:44:53
-- 伺服器版本： 10.4.24-MariaDB
-- PHP 版本： 7.4.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `mfee27_group2_project`
--

-- --------------------------------------------------------

--
-- 資料表結構 `recipe_material`
--

CREATE TABLE `recipe_material` (
  `id` int(3) UNSIGNED NOT NULL,
  `name` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `recipe_id` int(3) NOT NULL,
  `quantity` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `recipe_material`
--

INSERT INTO `recipe_material` (`id`, `name`, `recipe_id`, `quantity`) VALUES
(1, '奶油乳酪', 4, '450公克'),
(2, '糖', 4, '120公克'),
(3, '鹽', 4, '1小撮'),
(4, '雞蛋', 4, '3顆'),
(5, '鮮奶油', 4, '180公克'),
(6, '玉米粉', 4, '15公克'),
(7, '君度橙酒', 4, '1/2小匙'),
(8, '檸檬汁', 4, '1/2顆'),
(9, '草莓乾', 4, '適量'),
(10, '香草精', 4, '適量'),
(11, '蛋黃', 5, '40公克'),
(12, '蛋白', 5, '36公克'),
(13, '白糖', 5, '40公克'),
(14, '低筋麵粉', 5, '68公克'),
(15, '糖粉', 5, '適量'),
(16, '瑪斯卡邦', 5, '50公克'),
(17, '鮮奶油', 5, '200ml'),
(18, '檸檬汁', 5, '1/4顆'),
(19, '檸檬皮屑', 5, '1顆'),
(20, '低筋麵粉', 6, '160公克'),
(21, '奶油', 6, '150公克'),
(22, '糖粉', 6, '30公克'),
(23, '鹽', 6, '3.5公克'),
(24, '南瓜', 3, '300公克'),
(25, '洋蔥', 3, '1/2顆'),
(26, '黃豆', 3, '1杯'),
(27, '水', 3, '適量'),
(28, '雞蛋', 7, '3顆'),
(29, '牛奶', 7, '40ml'),
(30, '水', 7, '220ml'),
(31, '鯛魚片', 7, '1/2片'),
(32, '米酒', 7, '30ml'),
(33, '鹽', 7, '一小撮'),
(34, '白胡椒粉', 7, '一小撮'),
(35, '白飯', 8, '2碗'),
(36, '洋蔥', 8, '1/2顆'),
(37, '蝦仁', 8, '200克(約15尾)'),
(38, '花枝', 8, '200克 （約1/2隻）'),
(39, '綠花椰菜', 8, '1/2顆'),
(40, '奶油', 8, '少許'),
(41, '乳酪絲', 8, '適量'),
(42, '水', 8, '適量'),
(43, '牛奶', 8, '適量'),
(44, '雞胸肉', 9, '380公克'),
(45, '青蔥', 9, '3支'),
(46, '白芝麻', 9, '1小匙'),
(47, '醬油', 9, '1/2大匙'),
(48, '韓國辣椒醬', 9, '3大匙'),
(49, '番茄醬', 9, '3大匙'),
(50, '白糖', 9, '2大匙'),
(51, '香油', 9, '1大匙'),
(52, '蒜末', 9, '1/2大匙'),
(53, '薑末', 9, '1/2大匙'),
(54, '水蜜桃(罐頭/新鮮)', 10, '1顆'),
(55, '可爾必思', 10, '150ml'),
(56, '冰開水', 10, '300ml'),
(57, '冰塊', 10, '適量'),
(58, '檸檬皮屑', 10, '適量'),
(59, '檸檬飲', 11, '300ml'),
(60, '愛玉', 11, '1盒'),
(61, '韓式柚子醬', 11, '1大匙'),
(62, '冰塊', 11, '適量'),
(63, '檸檬片', 11, '適量'),
(64, '馬鞭草', 12, '2小株'),
(65, '薄荷', 12, '2小株'),
(66, '開水', 12, '450ml'),
(67, '去骨雞腿肉', 13, '350公克'),
(68, '油', 13, '1.5大匙'),
(69, '鹽', 13, '1/2小匙'),
(70, '黑胡椒', 13, '1/4小匙'),
(71, '迷迭香', 13, '3株'),
(72, '柚子果肉', 14, '1/2顆'),
(73, '蒜頭', 14, '5瓣'),
(74, '紅茶包', 14, '1包'),
(75, '蘋果', 14, '1顆'),
(76, '生辣椒', 14, '2根'),
(77, '醬油膏', 14, '100公克'),
(78, '沙拉油', 14, '50公克'),
(79, '味醂', 14, '50公克'),
(80, '芭樂', 15, '1/2顆'),
(81, '黃金奇異果', 15, '1顆'),
(82, '香吉士', 15, '1顆'),
(83, '水', 15, '200ml'),
(84, '馬鈴薯', 16, '2顆'),
(85, '低筋麵粉 ', 16, '20g'),
(86, '雞蛋 ', 16, '1顆'),
(87, '奶油 ', 16, '適量'),
(88, '鹽', 16, '適量'),
(89, '酥皮', 17, '3片'),
(90, '蘋果', 17, '5顆'),
(91, '白糖', 17, '300g'),
(92, '肉桂粉', 17, '3g'),
(93, '水', 17, '300ml'),
(94, '奶油', 17, '適量'),
(95, '開水', 18, '100ml'),
(96, '中筋麵粉', 18, '100公克'),
(97, '糯米粉', 18, '30公克'),
(98, '雞蛋', 18, '2顆'),
(99, '鹽巴', 18, '3公克'),
(100, '糖', 18, '2公克'),
(101, '植物油', 18, '5ml'),
(102, '韓式泡菜', 18, '100公克'),
(103, '紅蘿蔔', 18, '100公克'),
(104, '青蔥', 18, '2根'),
(105, '韭菜花', 18, '3根'),
(106, '小蝦仁', 18, '50公克'),
(107, '蛤蠣肉', 18, '20公克'),
(108, '花枝肉', 18, '20公克'),
(109, '洋蔥', 19, '2顆'),
(110, '咖哩粉', 19, '2大匙'),
(111, '牛番茄', 19, '1顆'),
(112, '綜合堅果', 19, '60公克'),
(113, '大蒜', 19, '4-5顆'),
(114, '薑', 19, '1塊'),
(115, '熱水', 19, '400ml'),
(116, '秋葵', 19, '4根'),
(117, '紅蘿蔔', 19, '1/4根'),
(118, '馬鈴薯', 19, '1顆'),
(119, '青花菜', 19, '1/4顆'),
(120, '蘑菇', 19, '4-5個'),
(121, '栗子南瓜', 19, '半顆'),
(122, '橄欖油', 19, '1大匙'),
(123, '鹽', 19, '1/4小匙'),
(124, '白胡椒粉', 19, '1/4小匙'),
(125, '雞腿', 20, '1隻'),
(126, '薑', 20, '4片'),
(127, '蔥', 20, '1隻'),
(128, '蒜頭', 20, '4顆'),
(129, '花椒粒', 20, '1小匙'),
(130, '米酒', 20, '1匙'),
(131, '米', 20, '2杯'),
(132, '月桂葉', 20, '2片'),
(133, '藜麥', 20, '1/4匙'),
(134, '白胡椒粉', 20, '1/4匙'),
(135, '鹽', 20, '1g'),
(136, '高筋麵粉', 21, '300公克'),
(137, '牛奶', 21, '210公克'),
(138, '糖', 21, '20公克'),
(139, '奶粉', 21, '10公克'),
(140, '鹽', 21, '4公克'),
(141, '速發酵母粉', 21, '3公克'),
(142, '無鹽奶油', 21, '20公克'),
(143, '鮮奶油', 1, '40ml'),
(144, '海鹽', 1, '少許'),
(145, '冰手沖咖啡', 1, '180ml'),
(146, '冰塊', 1, '3顆'),
(147, '可可粉或肉桂粉', 1, '少許'),
(148, '覆盆莓果醬', 2, '1小匙'),
(149, '柳橙汁', 2, '50ml'),
(150, '冰手沖咖啡', 2, '150ml'),
(151, '氣泡水或雪碧', 2, '50ml');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `recipe_material`
--
ALTER TABLE `recipe_material`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `recipe_material`
--
ALTER TABLE `recipe_material`
  MODIFY `id` int(3) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=152;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
