-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2022-07-03 22:44:37
-- 伺服器版本： 10.4.24-MariaDB
-- PHP 版本： 7.4.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `mfee27_group2_project`
--

-- --------------------------------------------------------

--
-- 資料表結構 `recipe`
--

CREATE TABLE `recipe` (
  `id` int(3) UNSIGNED NOT NULL,
  `name` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `content` varchar(200) COLLATE utf8mb4_unicode_ci NOT NULL,
  `image` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `category_food` int(3) NOT NULL,
  `category_product` int(3) NOT NULL,
  `user_id` int(3) NOT NULL,
  `create_time` datetime NOT NULL,
  `valid` int(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `recipe`
--

INSERT INTO `recipe` (`id`, `name`, `content`, `image`, `category_food`, `category_product`, `user_id`, `create_time`, `valid`) VALUES
(1, '海鹽奶蓋咖啡', '鮮奶油加入一小撮海鹽，使甜味更多變化而不死甜。利用輕巧電動奶泡器打發鮮奶油，使鮮奶油更綿密，就像此飲品的蓋子，故稱「奶蓋」。製作時依序鋪上後勿攪拌，可喝出不同的口感，第一口先碰到綿密奶蓋，可從奶蓋縫隙中微微啜飲到香醇手沖咖啡，隨著奶蓋與咖啡融合，也能喝到類似康寶藍或拿鐵、卡布奇諾咖啡的神奇多重口感。', 'SeaSaltCoffee.jpg', 2, 2, 0, '2022-01-05 17:49:04', 0),
(2, '橘色夕陽', '迷幻又漂亮的分層飲料總是吸引人目光，橘色夕陽就是這樣一款冰手沖特調！利用覆盆莓的火紅、柳橙汁的鮮黃、手沖咖啡的深棕色，依序將飲品由密度「由高到低」加入，不要攪拌，就可以完成美麗的分層橘色夕陽！為求口感清爽，可加入氣泡水或雪碧，是一款看了心情就很好，喝起來更想大口暢飲的手沖特調。', 'OrangeSunset.jpg', 2, 2, 0, '2022-01-10 17:49:04', 1),
(3, '南瓜豆漿濃湯', '\"南瓜去皮、切塊，洋蔥去膜、切塊，黃豆洗淨瀝乾。\r\n取一調理杯，放入南瓜、洋蔥、黃豆，再加水至熱湯最高水位線。\r\n蓋上上蓋，選擇【濃湯】模式。\r\n待行程結束，即可享用。\"', 'pumkimSoup.jpg', 3, 6, 0, '2022-01-15 17:49:04', 0),
(4, '莓果巴斯克乳酪蛋糕', '巴斯克乳酪蛋糕因為做法太簡單，紅了幾年仍是各烘焙社團裡受歡迎的品項之一，連新手都不太會出錯，真是讓人充滿成就感的蛋糕呢！如果吃膩原本的口味，或許來點新變化也不錯。運用草莓乾酸甜的口感淡化濃郁的乳酪，帶出微妙的和諧，若害怕乳酪過於厚重濃膩，不妨試著加入水果乾來平衡，不但滋味清爽還有淡淡的果香，吃起來更有層次。', 'cheeseCake.jpg', 1, 8, 0, '2022-02-03 17:49:04', 0),
(5, '台式馬卡龍', '法式馬卡龍口感較輕盈，有少女酥胸的美名；台式馬卡龍口感較鬆軟，中間會夾奶油霜，口感像蛋糕又有餅乾的酥脆，小時候的麵包店經常可見這類點心，是不少人的集體回憶。現在自己也可以動手作，復刻童年時那迷人小圓餅的風味。', 'macaron.jpg', 1, 8, 0, '2022-02-13 17:49:04', 1),
(6, '曲奇餅乾', '\"曲奇，來源於英語COOKIE，是由香港傳入的粵語譯音，據考究最初由伊朗人發明，而曲奇餅在美國與加拿大解釋為細小而扁平的蛋糕式餅乾，口感不過度酥脆且風味香甜，深受大眾喜愛。', 'cookie.jpg', 1, 8, 0, '2022-02-23 17:55:27', 1),
(7, '鯛魚牛奶蒸蛋', '\"鯛魚片洗淨擦乾，並準備其他食材。\r\n取一容器打入雞蛋、米酒、鹽、胡椒粉拌勻。\r\n續加入水、牛奶攪勻過濾倒入蒸碗裡。\r\n湯鍋內放入蒸架和1碗水，在放上做法3，蓋上鍋蓋。\r\n將\"\"無段式火力控制旋鈕\"\"轉至大火，先蒸25分鐘。\r\n續開蓋放上鯛魚片，再蓋上鍋蓋續蒸5分鐘即可。', 'steamedEggwithSnapper.jpg', 1, 7, 0, '2022-03-15 17:55:27', 1),
(8, '海鮮燉飯', '將洋蔥切碎，蝦仁去腸泥，花枝切丁，青花菜洗淨切小朵。\r\n將奶油放入美食鍋中，按鈕轉至「高溫」，加入洋蔥爆香。\r\n加入蝦仁、花枝、青花菜炒至半熟，再加入白飯，倒入與食材平高的水和牛奶待滾，加入適量鹽和黑胡椒，攪拌均勻。\r\n最後加入起司絲，以【低溫】燜煮3分鐘，即可享用。', 'seafoodStew.jpg', 3, 7, 0, '2022-03-25 17:55:27', 1),
(9, '韓式雞肉串燒', '酸酸辣辣的韓式雞肉串燒是最方便又美味的搭配了！醃漬的鮮嫩雞胸肉塗滿韓式串燒醬，非常夠味；燒烤過程中，醬汁全部收進去，表皮焦脆、肉質香軟多汁，撒上白芝麻更添風味！還可以邊烤邊吃，增添親友相聚的樂趣！', 'KoreanSkewers.jpeg', 5, 9, 0, '2022-03-30 17:55:27', 1),
(10, '盛夏午後(蜜桃可爾必思氣泡飲)', '很多人喜歡喝「可爾必思」，但可能不知道它發明的由來。創辦人三島海雲造訪內蒙古時，因旅途勞累喝了當地傳統酸乳而恢復元氣，於是開始深入研發，後來便成了大家喜愛的「可爾必思」，並於1919年7月7日七夕情人節正式發售，至今已超過百年歷史。可爾必思除了可以改善腸胃道消化機能外，它也很百搭，不論是調配成茶飲、水果飲或調酒做成莎瓦…等，就更別說近年流行的氣泡飲了，氣泡水加上水蜜桃的酸甜口感，喝了是不是讓人感到', 'karupisu.jpg', 2, 3, 1, '2022-04-06 17:55:27', 1),
(11, '柚子檸檬愛玉氣泡飲', '只要夏天一到，就會想吃些清爽的甜品來消消暑，這道柚子檸檬愛玉氣泡飲正好是最佳的選擇，柚子香氣配上用檸檬飲打成的氣泡水，豐富的維生素C既養顏又美白，再加上Q彈軟嫩的愛玉當配料，酸酸甜甜帶點酸V~酸V的滋味，保證清涼無比暑氣全消。炎炎夏日，就為自己做這道飲品來撫平一下躁熱的心吧！', 'saranheyo.jpg', 2, 3, 1, '2022-04-16 17:55:27', 1),
(12, '香草薄荷氣泡飲', '薄荷含有「熱時清涼，冷時暖身」的特殊功效，一年四季皆可見，而馬鞭草具有溫和與鎮定的效果，既能幫助睡眠也能消除沮喪的情緒，其針對交感神經系統也有調節與安撫的作用，可藉此改善神經性失眠，兩者融入碳酸氣泡水裡，不僅消暑又能兼顧健康。', 'vanilla.jpg', 2, 3, 1, '2022-04-26 17:55:27', 1),
(13, '迷迭香雞腿排', '迷迭香香氣清郁，可以幫助肉類消除腥味、增加芬芳香氣，搭配著一起食用非常適合！用去骨雞腿排搭配稍許調味，煎烤出表皮焦香的效果，原來完成西餐當中的一道主食，這麼簡單！', 'RosemaryChicken.jpeg', 3, 9, 2, '2022-05-09 17:55:27', 1),
(14, '柚香燒烤醬', '吃烤肉最怕渾身肉味！這份食譜的食材以柚子果肉、蘋果果肉為基底，還加入清爽的紅茶茶葉，讓燒烤醬多了「果茶」的風味！但燒烤醬當然不能少了辛香料，生辣椒、蒜頭為食材增添刺激感！', 'GrapefruitBBQSauce.jpeg', 4, 10, 2, '2022-05-19 17:55:27', 1),
(15, '維生素C飲', '芭樂、黃金奇異果、香吉士皆富含維生素C及膳食纖維，很適合想增強免疫力及想要美白的女生。切好的水果塊加入隨行果汁機中，只要三十秒就能打成新鮮果汁，供給一天滿滿的元氣！', 'VitaminC.jpeg', 2, 10, 2, '2022-05-29 17:55:27', 1),
(16, '馬鈴薯絲鬆餅', '吃太多甜食想來點鹹的？做個馬鈴薯絲鬆餅吧，無油、無奶、無糖，感覺非常健康。馬鈴薯富含維生素C、鉀以及膳食纖維，是很營養的食材，可做為簡餐的澱粉主食，佐以生菜沙拉，不但有飽足感，也不用擔心負擔太重，做為輕食料理非常適合。', 'ShreddedPotatoMuffins.jpeg', 1, 11, 3, '2022-06-01 17:55:27', 1),
(17, '酥皮蘋果派', '蘋果派是象徵美國文化最具代表性的甜點之一，二次世界大戰前，甚至出現這句：「No pie-eating people can be permanently vanquished。」（吃蘋果派的人打不倒），不過江湖傳言，蘋果派並非源自於美國，而是來自英格蘭，最早的蘋果派食譜出現在1381年。傳統的蘋果派是以派皮覆蓋水果餡料，口感酸甜、層次豐富，做起來也比較費時，利用鬆餅機和市售的酥皮就能做出簡單美味的', 'ApplePie.jpeg', 1, 11, 3, '2022-06-09 17:55:27', 1),
(18, '烤蔬菜堅果咖哩', '如果想變化一下不同的蔬菜料理方式，不妨試試這道集眾多食材的烤時蔬佐堅果咖哩醬。烘烤過的鮮蔬，不僅表面有著美麗的焦糖烤色、保留爽脆的口感，還可以吃出蔬菜本身最接近原始的味道，再佐上加了堅果的咖哩醬，讓人不小心又多犧牲了一碗白飯。', 'KimchiSeafoodPancakes.jpeg', 4, 12, 4, '2022-06-15 17:55:27', 1),
(19, '熱壓泡菜海鮮煎餅', '之前新聞報導市售米餅有一批被驗出含重金屬，讓許多家長們心慌慌，本來是要給孩子們健康的飲食，沒想到還是誤觸了地雷，所以不如自己動手做吧！不但食材安心、成份單純，健康又營養，運用鬆餅機製作天然的米餅，還可以發揮技巧讓它變身成漢堡，顏色繽紛、食欲大增哪！', 'VegetableNutCurry.jpeg', 5, 11, 4, '2022-06-18 17:55:27', 1),
(20, '海南雞藜麥飯', '藜麥被美國太空總署視為「最理想的太空糧食」，許多健身、減重及素食者會在飲食中添加藜麥，以增進蛋白質的攝取與飽足感，同時藜麥也具有抗氧化、抗發炎和降血壓的功效。在白飯中添加了藜麥，除了美味更具營養價值，如果喜歡藜麥的口感，也可以將白米與藜麥的比例做適當調換，不失為減少攝取澱粉的方法之一。', 'ChickenQuinoaRice.jpeg', 3, 12, 5, '2022-06-20 17:55:27', 1),
(21, '白吐司(水合法)', '“水合法”是將初步混合好的麵團密封，再透過冰箱冷藏半小時以上，讓麵團在自我分解的過程中產生麵筋，之後再放入酵母及軟化的奶油攪拌揉製出薄膜，目的是改善攪拌溫度過高與縮短攪拌時間。雖然操作時間稍長，但配合高筋麵粉製作出來的吐司，口感鬆軟又有嚼勁。運用攪拌機攪打更均勻，更可節省手揉時間，讓您在家也可輕鬆完成質地鬆軟、香氣四溢的吐司麵包。', 'WhiteToast.jpeg', 1, 12, 5, '2022-07-02 17:55:27', 1);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `recipe`
--
ALTER TABLE `recipe`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `recipe`
--
ALTER TABLE `recipe`
  MODIFY `id` int(3) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
